import React from "react";

const About = () => {
  const about = `"विकसित भारत" त्रैमासिक पत्रिका 2024 में शुरू हुआ, जो प्रतिष्ठित "शिक्षा महाकुंभ की गूंज" का एक रूपांतरित विकास है। यह पत्रिका शिक्षा महाकुंभ पहल का एक अभिन्न अंग है, जो डिपार्टमेंट ऑफ होलिस्टिक एजुकेशन (डीएचई) द्वारा संचालित एक विशिष्ट प्रयास है। डीएचई, जो कि डॉ. ठाकुर एसकेआर, प्रसिद्ध इसरो वैज्ञानिक, समर्पित आरएसएस कार्यकर्ता, और कुशल लेखक द्वारा स्थापित एक दूरदर्शी प्रयास है, शिक्षा को केवल पन्नों पर अंक नहीं मानता है। यह युवा मनों के संपूर्ण परिवर्तन को समाज के मूल्यवान संसाधनों में बदलने का प्रतीक है.
  
  इस भावना के साथ, "विकसित भारत" शिक्षा की उन्नति के लिए समर्पित है। हम दृढ़ता से मानते हैं कि शिक्षा का मूल्य केवल अकादमिक अंकों से नहीं मापा जा सकता है। सच्ची शिक्षा में व्यक्तियों का समग्र विकास शामिल होता है, जिसमें पाठ्यपुस्तकों से परे ऊर्जा, कौशल और मूल्य शामिल होते हैं। हमारी पत्रिका उन सभी के लिए एक खुला निमंत्रण है जो इस दृष्टि को साझा करते हैं और वैश्विक शैक्षिक परिदृश्य से संबंधित चर्चाओं, शोध और अंतर्दृष्टि को पोषित करने के लिए प्रतिबद्ध हैं.
    
  "विकसित भारत" शिक्षा के विभिन्न पहलुओं का व्यापक कवरेज प्रदान करता है, स्कूल शिक्षा से लेकर उच्च शिक्षा, भाषा शिक्षा से लेकर तकनीकी प्रगति, बाल शिक्षा से लेकर वैज्ञानिक अनुसंधान तक। इसमें अग्रणी शोध, दूरदर्शी दृष्टिकोण और शिक्षण और सीखने के निरंतर विकसित हो रहे क्षेत्र के हर पहलू की गहन जांच शामिल है। यह शिक्षा के क्षेत्र में ज्ञान, प्रेरणा और नवाचार से भरी दुनिया का पासपोर्ट है.
    
  "विकसित भारत" में कवर किए गए विषय हमारी समग्र शिक्षा दृष्टिकोण के प्रति हमारी प्रतिबद्धता का प्रमाण हैं। हम स्कूल और विश्वविद्यालय शिक्षा, भाषा शिक्षा, बाल शिक्षा, अनुसंधान और विकास, कानूनी शिक्षा, खेल, तकनीक और बुनियादी विज्ञान का अन्वेषण करते हैं। हमारी पत्रिका का बहुआयामी दृष्टिकोण सुनिश्चित करता है कि आप निरंतर बदलते शैक्षिक परिदृश्य में सबसे आगे बने रहें.
  `;

  // Publisher information
  const publisherDetails = (
    <div className="mt-6">
      <h3 className="text-lg font-semibold text-black">प्रकाशक की जानकारी</h3>
      <p className="mt-2 text-black">प्रकाशक: डॉ. ठाकुर सुदेश कुमार रौनिजा</p>
      <p className="text-black">द्वारा प्रकाशित: डॉ. ठाकुर सुदेश कुमार रौनिजा</p>
      <p className="text-black">ईमेल: <a href="mailto:pub.dhe4@gmail.com" className="text-blue-600 hover:underline">pub.dhe4@gmail.com</a></p>
      
      <h4 className="mt-4 font-semibold text-black">संपादकीय एवं प्रकाशन कार्यालय</h4>
      <p className="text-black">एएमसीएफ-132, आर्या नगर, बल्लबागढ़,</p>
      <p className="text-black">फ़रीदाबाद-121004, हरियाणा</p>
    </div>
  );

  return (
    <div className="bg-white p-6">
      <section id="about-us" className="mb-8">
        <h2 className="text-xl font-semibold text-black">
          इस पत्रिका के बारे में
        </h2>
        <p className="mt-4 text-justify text-black whitespace-pre-line">
          {about}
        </p>
      </section>
      {/* Add the publisher information section here */}
      {publisherDetails}
    </div>
  );
};

export default About;
